![Alt text]()

<div class="alert alert-block alert-info" style="font-size:14px; font-family:verdana; line-height: 1.7em;"> Pandas is an open-source data manipulation and analysis library for the Python programming language. It provides data structures and functions for working with structured data, such as tabular data, time series, and more. Pandas is a popular choice for data scientists, analysts, and researchers when it comes to data cleaning, transformation, and analysis.</div>

In [1]:
import pandas as pd
import numpy as np

# <span style='color:#150458 '> Use Cases : </span>

<div class="alert alert-block alert-info" style="font-size:14px; font-family:verdana; line-height: 1.7em;"> 
    
1. Reading CSV/excel/JSON file
    
2. EDA
    
3. Data Cleaning
    
4. Encoding(OneHot Encoder)
    
5. Join Tables (left , right, inner, outer)
    
6. Feature Selection
</div>

# <span style='color:#150458 '> Data Structures : </span>

## 1 <span style='color:#E70488 '> | </span> Series

<div class="alert alert-block alert-info" style="font-size:14px; font-family:verdana; line-height: 1.7em;"> A one-dimensional labeled array capable of holding any data type (integers, strings, floating-point numbers, Python objects, etc.). It is similar to a one-dimensional NumPy array, but it has an index, which makes it more flexible. </div>

In [2]:
series = pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])
series

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [3]:
series2 = pd.Series(['a','b','c','d','e'])
series2

0    a
1    b
2    c
3    d
4    e
dtype: object

## 2 <span style='color:#E70488 '> | </span> DataFrame

<div class="alert alert-block alert-info" style="font-size:14px; font-family:verdana; line-height: 1.7em;">

* A two-dimensional labeled data structure with columns of potentially different data types. It is similar to a spreadsheet or SQL table, where each column can have a different type.

    
* Two Data Structures:
    1. DataFrame (2-D >> rows and column)
    2. Series(1-D array) >> Single column of dataframe</div>

In [4]:
data = {'Name':['Alka','Madhu','Kiara'],
       'Age':[34,54,23],
       'City':['NY','Mumbai','Delhi']}

df = pd.DataFrame(data)
df

    Name  Age    City
0   Alka   34      NY
1  Madhu   54  Mumbai
2  Kiara   23   Delhi

<div class="alert alert-block alert-info" style="font-size:14px; font-family:verdana; line-height: 1.7em;"> In addition to these main data structures, Pandas also provides other specialized data structures like Index, TimeSeries, and Categorical. Here's a brief overview: </div>

###  <span style='color:#E70488 '> [ </span> Index<span style='color:#E70488 '> ] </span>

In [5]:
index = pd.Index(['a','b','c','d'])
index

Index(['a', 'b', 'c', 'd'], dtype='object')

###  <span style='color:#E70488 '> [ </span> TimeSeries <span style='color:#E70488 '> ] </span>

In [6]:
dates = pd.date_range('2020-01-01', periods=5)
ts = pd.Series([1,2,3,4,5],index=dates)
dates

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05'],
              dtype='datetime64[ns]', freq='D')

###  <span style='color:#E70488 '> [ </span> Categorical <span style='color:#E70488 '> ] </span>

In [7]:
cat = pd.Categorical(['a','b','c'])
cat

['a', 'b', 'c']
Categories (3, object): ['a', 'b', 'c']

# <span style='color:#150458 '> Functions : </span>

###  <span style='color:#E70488 '> [ </span> Read DataFrame <span style='color:#E70488 '> ] </span>

In [8]:
df_heart = pd.read_csv('heart.csv')
df_heart

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
299,45,1,3,110,264,0,1,132,0,1.2,1,0,3,0
300,68,1,0,144,193,1,1,141,0,3.4,1,2,3,0
301,57,1,0,130,131,0,1,115,1,1.2,1,1,3,0
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0

In [9]:
df_emp = pd.read_excel('Emp_Records.xlsx')
df_emp

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60,13.68,168251,Denver
1,940761,Brenda,47.02,60,9.01,51063,Stonewall
2,428945,Joe,54.15,68,0.98,50155,Michigantown
3,408351,Diane,39.67,51,18.30,180294,Hydetown
4,193819,Benjamin,40.31,58,4.01,117642,Fremont
...,...,...,...,...,...,...,...
95,639892,Jose,22.82,89,1.05,129774,Biloxi
96,704709,Harold,32.61,77,5.93,156194,Carol Stream
97,461593,Nicole,52.66,60,28.53,95673,Detroit
98,392491,Theresa,29.60,57,6.99,51015,Mc Grath
99,495141,Tammy,38.38,55,2.26,93650,Alma

In [10]:
df2 = pd.read_excel('Emp_Records.xlsx', sheet_name = 'emp_salary')
df2

    Salary          City
0   168251        Denver
1    51063     Stonewall
2    50155  Michigantown
3   180294      Hydetown
4   117642       Fremont
..     ...           ...
95  129774        Biloxi
96  156194  Carol Stream
97   95673       Detroit
98   51015      Mc Grath
99   93650          Alma

[100 rows x 2 columns]

In [88]:
df = pd.read_csv('titanic.csv')

###  <span style='color:#E70488 '> [ </span> Shape of Dataframe <span style='color:#E70488 '> ] </span>

In [11]:
df_emp.shape

(100, 7)

In [12]:
print("Number of rows :", df_emp.shape[0])
print("Number of columns :", df_emp.shape[1])

Number of rows : 100
Number of columns : 7

###  <span style='color:#E70488 '> [ </span> Columns <span style='color:#E70488 '> ] </span>

<div class="alert alert-block alert-info" style="font-size:14px; font-family:verdana; line-height: 1.7em;"> To get column names from dataframe </div>

In [13]:
df_emp.columns

Index(['Emp ID', 'First Name', 'Age in Yrs', 'Weight in Kgs', 'Age in Company',
       'Salary', 'City'],
      dtype='object')

###  <span style='color:#E70488 '> [ </span> Index <span style='color:#E70488 '> ] </span>

In [14]:
df_emp.index

RangeIndex(start=0, stop=100, step=1)

###  <span style='color:#E70488 '> [ </span> Axes <span style='color:#E70488 '> ] </span>

In [15]:
df_emp.axes

[RangeIndex(start=0, stop=100, step=1),
 Index(['Emp ID', 'First Name', 'Age in Yrs', 'Weight in Kgs', 'Age in Company',
        'Salary', 'City'],
       dtype='object')]

###  <span style='color:#E70488 '> [ </span> dtypes <span style='color:#E70488 '> ] </span>

<div class="alert alert-block alert-info" style="font-size:14px; font-family:verdana; line-height: 1.7em;"> To get datatypes of coulmns  </div>

In [16]:
df_emp.dtypes

Emp ID              int64
First Name         object
Age in Yrs        float64
Weight in Kgs       int64
Age in Company    float64
Salary              int64
City               object
dtype: object

###  <span style='color:#E70488 '> [ </span> info <span style='color:#E70488 '> ] </span>

In [17]:
df_emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Emp ID          100 non-null    int64
 1   First Name      100 non-null    object
 2   Age in Yrs      100 non-null    float64
 3   Weight in Kgs   100 non-null    int64
 4   Age in Company  100 non-null    float64
 5   Salary          100 non-null    int64
 6   City            100 non-null    object
dtypes: float64(2), int64(3), object(2)
memory usage: 5.6+ KB

In [104]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Gender       891 non-null    int64
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(6), object(4)
memory usage: 83.7+ KB

###  <span style='color:#E70488 '> [ </span> describe <span style='color:#E70488 '> ] </span>

<div class="alert alert-block alert-info" style="font-size:14px; font-family:verdana; line-height: 1.7em;">To get statistical summary  </div>

In [18]:
df_emp.describe()

             Emp ID  Age in Yrs  Weight in Kgs  Age in Company         Salary
count     100.00000  100.000000     100.000000      100.000000     100.000000
mean   547652.10000   39.238700      58.080000        8.978400  119738.090000
std    257664.16679   12.066252      12.294106        8.657358   46185.278194
min    134841.00000   21.100000      40.000000        0.020000   42005.000000
25%    328643.75000   28.177500      50.000000        2.152500   83979.750000
50%    497414.00000   37.595000      56.000000        6.435000  118049.500000
75%    766040.00000   49.900000      61.250000       13.762500  162509.250000
max    979607.00000   59.470000      90.000000       34.520000  197537.000000

In [101]:
df.describe()

,PassengerId,Survived,Pclass,Gender,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.386083,2.308642,0.352413,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.487123,0.836071,0.477990,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,0.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,0.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,1.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,1.000000,80.000000,8.000000,6.000000,512.329200

In [102]:
df.describe(include='all')

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,891.000000,891.000000,891.000000,891,891.000000,714.000000,891.000000,891.000000,891,891.000000,204,889
unique,NaN,NaN,NaN,891,NaN,NaN,NaN,NaN,681,NaN,147,3
top,NaN,NaN,NaN,"Braund, Mr. Owen Harris",NaN,NaN,NaN,NaN,347082,NaN,B96 B98,S
freq,NaN,NaN,NaN,1,NaN,NaN,NaN,NaN,7,NaN,4,644
mean,446.000000,0.386083,2.308642,NaN,0.352413,29.699118,0.523008,0.381594,NaN,32.204208,NaN,NaN
std,257.353842,0.487123,0.836071,NaN,0.477990,14.526497,1.102743,0.806057,NaN,49.693429,NaN,NaN
min,1.000000,0.000000,1.000000,NaN,0.000000,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,223.500000,0.000000,2.000000,NaN,0.000000,20.125000,0.000000,0.000000,NaN,7.910400,NaN,NaN
50%,446.000000,0.000000,3.000000,NaN,0.000000,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,668.500000,1.000000,3.000000,NaN,1.000000,38.000000,1.000000,0.000000,NaN,31.000000,NaN,NaN
max,891.000000,1.000000,3.000000,NaN,1.000000,80.000000,8.000000,6.000000,NaN,512.329200,NaN,NaN

###  <span style='color:#E70488 '> [ </span> duplicates <span style='color:#E70488 '> ] </span>

<div class="alert alert-block alert-info" style="font-size:14px; font-family:verdana; line-height: 1.7em;">To find if dataset has any duplicate values  </div>

In [19]:
df_emp.duplicated()

0     False
1     False
2     False
3     False
4     False
      ...
95    False
96    False
97    False
98    False
99    False
Length: 100, dtype: bool

In [20]:
df.duplicated().sum()

0

###  <span style='color:#E70488 '> [ </span> value_counts() <span style='color:#E70488 '> ] </span>

<div class="alert alert-block alert-info" style="font-size:14px; font-family:verdana; line-height: 1.7em;">To get a count of categorical observations  </div>

In [85]:
df_emp['City'].value_counts()

Wright           1
Woodbury         1
Conroy           1
Cookeville       1
Delmita          1
                ..
Primm Springs    1
Quecreek         1
Racine           1
Randallstown     1
Albion           1
Name: City, Length: 72, dtype: int64

In [89]:
df['Gender'].value_counts()

male      577
female    314
Name: Gender, dtype: int64

###  <span style='color:#E70488 '> [ </span> unique() <span style='color:#E70488 '> ] </span>

<div class="alert alert-block alert-info" style="font-size:14px; font-family:verdana; line-height: 1.7em;">To get unique categorical observations  </div>

In [90]:
df['Gender'].unique()

array(['male', 'female'], dtype=object)

In [95]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

###  <span style='color:#E70488 '> [ </span> nunique() <span style='color:#E70488 '> ] </span>

<div class="alert alert-block alert-info" style="font-size:14px; font-family:verdana; line-height: 1.7em;">To get count of unique observations  </div>

In [97]:
df['Gender'].nunique()

2

###  <span style='color:#E70488 '> [ </span> series to dict <span style='color:#E70488 '> ] </span>

In [98]:
df['Gender'].value_counts().to_dict()

{'male': 577, 'female': 314}

###  <span style='color:#E70488 '> [ </span> replace() <span style='color:#E70488 '> ] </span>

In [99]:
df['Gender'].replace({'male': 0, 'female': 1})

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    1
889    0
890    0
Name: Gender, Length: 891, dtype: int64

In [100]:
df['Gender'].replace({'male': 0, 'female': 1},inplace=True)

###  <span style='color:#E70488 '> [ </span> astype <span style='color:#E70488 '> ] </span>

<div class="alert alert-block alert-info" style="font-size:14px; font-family:verdana; line-height: 1.7em;">To change datatype of column  </div>

In [107]:
df['PassengerId'].astype('float')

0        1.0
1        2.0
2        3.0
3        4.0
4        5.0
       ...
886    887.0
887    888.0
888    889.0
889    890.0
890    891.0
Name: PassengerId, Length: 891, dtype: float64

In [108]:
df['Pclass'] = df['Pclass'].astype('float')

###  <span style='color:#E70488 '> [ </span> insert() <span style='color:#E70488 '> ] </span>

<div class="alert alert-block alert-info" style="font-size:14px; font-family:verdana; line-height: 1.7em;">

* Inserting column in dataframe
    
* df.insert(index_number , Column_Name, Value, allow_duplicates=)  </div>

In [109]:
df.head(2)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3.0,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,C

In [111]:
df.insert(1,'ID',10)

In [112]:
df.head(2)

,PassengerId,ID,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,10,0,3.0,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,10,1,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,C

###  <span style='color:#E70488 '> [ </span> rename() <span style='color:#E70488 '> ] </span>

In [113]:
df.rename({'Gender':'Sex'},axis=1)

,PassengerId,ID,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,10,0,3.0,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,10,1,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,C
2,3,10,1,3.0,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,10,1,1.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,S
4,5,10,0,3.0,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,10,0,2.0,"Montvila, Rev. Juozas",0,27.0,0,0,211536,13.0000,NaN,S
887,888,10,1,1.0,"Graham, Miss. Margaret Edith",1,19.0,0,0,112053,30.0000,B42,S
888,889,10,0,3.0,"Johnston, Miss. Catherine Helen ""Carrie""",1,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,10,1,1.0,"Behr, Mr. Karl Howell",0,26.0,0,0,111369,30.0000,C148,C
890,891,10,0,3.0,"Dooley, Mr. Patrick",0,32.0,0,0,370376,7.7500,NaN,Q

# <span style='color:#150458 '> Access Data from Dataframe : </span>

###  <span style='color:#E70488 '> [ </span> Access columns <span style='color:#E70488 '> ] </span>

In [21]:
df_emp['Salary']

0     168251
1      51063
2      50155
3     180294
4     117642
       ...
95    129774
96    156194
97     95673
98     51015
99     93650
Name: Salary, Length: 100, dtype: int64

In [22]:
df_emp[['Emp ID', 'First Name', 'Age in Yrs']]

    Emp ID First Name  Age in Yrs
0   677509       Lois       36.36
1   940761     Brenda       47.02
2   428945        Joe       54.15
3   408351      Diane       39.67
4   193819   Benjamin       40.31
..     ...        ...         ...
95  639892       Jose       22.82
96  704709     Harold       32.61
97  461593     Nicole       52.66
98  392491    Theresa       29.60
99  495141      Tammy       38.38

[100 rows x 3 columns]

###  <span style='color:#E70488 '> [ </span> Access rows <span style='color:#E70488 '> ] </span>

####  <span style='color:#E70488 '> First N rows : </span>

In [23]:
df_emp.head() #5rows

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60,13.68,168251,Denver
1,940761,Brenda,47.02,60,9.01,51063,Stonewall
2,428945,Joe,54.15,68,0.98,50155,Michigantown
3,408351,Diane,39.67,51,18.30,180294,Hydetown
4,193819,Benjamin,40.31,58,4.01,117642,Fremont

In [24]:
df_emp.head(10)

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60,13.68,168251,Denver
1,940761,Brenda,47.02,60,9.01,51063,Stonewall
2,428945,Joe,54.15,68,0.98,50155,Michigantown
3,408351,Diane,39.67,51,18.30,180294,Hydetown
4,193819,Benjamin,40.31,58,4.01,117642,Fremont
5,499687,Patrick,34.86,58,12.02,72305,Macksburg
6,539712,Nancy,22.14,50,0.87,98189,Atlanta
7,380086,Carol,59.12,40,34.52,60918,Blanchester
8,477616,Frances,58.18,42,23.27,121587,Delmita
9,162402,Diana,29.73,60,3.44,43010,Eureka Springs

####  <span style='color:#E70488 '> Last N rows : </span>

In [25]:
df_emp.tail() #5rows

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
95,639892,Jose,22.82,89,1.05,129774,Biloxi
96,704709,Harold,32.61,77,5.93,156194,Carol Stream
97,461593,Nicole,52.66,60,28.53,95673,Detroit
98,392491,Theresa,29.60,57,6.99,51015,Mc Grath
99,495141,Tammy,38.38,55,2.26,93650,Alma

In [26]:
df_emp.tail(10)

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
90,185032,Eugene,37.84,59,2.64,122950,Racine
91,867084,Deborah,39.77,54,15.41,52767,Atqasuk
92,969964,Janice,37.57,56,0.93,147641,Whiteman Air Force Base
93,158666,Rebecca,56.00,55,34.32,160043,Independence
94,489424,Phillip,39.43,82,1.56,181774,Mapleton
95,639892,Jose,22.82,89,1.05,129774,Biloxi
96,704709,Harold,32.61,77,5.93,156194,Carol Stream
97,461593,Nicole,52.66,60,28.53,95673,Detroit
98,392491,Theresa,29.60,57,6.99,51015,Mc Grath
99,495141,Tammy,38.38,55,2.26,93650,Alma

###  <span style='color:#E70488 '> [ </span> Access rows & Columns <span style='color:#E70488 '> ] </span>

####  <span style='color:#E70488 '> 1.Slicing Method : </span>

In [27]:
df_emp[4:8]

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
4,193819,Benjamin,40.31,58,4.01,117642,Fremont
5,499687,Patrick,34.86,58,12.02,72305,Macksburg
6,539712,Nancy,22.14,50,0.87,98189,Atlanta
7,380086,Carol,59.12,40,34.52,60918,Blanchester

####  <span style='color:#E70488 '> 2.iloc Method : </span>

In [28]:
df_emp.iloc[:,:]

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60,13.68,168251,Denver
1,940761,Brenda,47.02,60,9.01,51063,Stonewall
2,428945,Joe,54.15,68,0.98,50155,Michigantown
3,408351,Diane,39.67,51,18.30,180294,Hydetown
4,193819,Benjamin,40.31,58,4.01,117642,Fremont
...,...,...,...,...,...,...,...
95,639892,Jose,22.82,89,1.05,129774,Biloxi
96,704709,Harold,32.61,77,5.93,156194,Carol Stream
97,461593,Nicole,52.66,60,28.53,95673,Detroit
98,392491,Theresa,29.60,57,6.99,51015,Mc Grath
99,495141,Tammy,38.38,55,2.26,93650,Alma

In [29]:
df_emp.iloc[3:9,1:3]

  First Name  Age in Yrs
3      Diane       39.67
4   Benjamin       40.31
5    Patrick       34.86
6      Nancy       22.14
7      Carol       59.12
8    Frances       58.18

In [30]:
df_emp.iloc[[1,4],[3,6]]

   Weight in Kgs       City
1             60  Stonewall
4             58    Fremont

####  <span style='color:#E70488 '> 3.loc Method : </span>

In [31]:
df_emp.loc[:,:]

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60,13.68,168251,Denver
1,940761,Brenda,47.02,60,9.01,51063,Stonewall
2,428945,Joe,54.15,68,0.98,50155,Michigantown
3,408351,Diane,39.67,51,18.30,180294,Hydetown
4,193819,Benjamin,40.31,58,4.01,117642,Fremont
...,...,...,...,...,...,...,...
95,639892,Jose,22.82,89,1.05,129774,Biloxi
96,704709,Harold,32.61,77,5.93,156194,Carol Stream
97,461593,Nicole,52.66,60,28.53,95673,Detroit
98,392491,Theresa,29.60,57,6.99,51015,Mc Grath
99,495141,Tammy,38.38,55,2.26,93650,Alma

In [32]:
df_emp.loc[2:5,'City']

2    Michigantown
3        Hydetown
4         Fremont
5       Macksburg
Name: City, dtype: object

In [33]:
df_emp.loc[2:5,'Weight in Kgs':'Salary']

   Weight in Kgs  Age in Company  Salary
2             68            0.98   50155
3             51           18.30  180294
4             58            4.01  117642
5             58           12.02   72305

In [34]:
df_emp.loc[[4,7,99],['Weight in Kgs','Salary','City']]

    Weight in Kgs  Salary         City
4              58  117642      Fremont
7              40   60918  Blanchester
99             55   93650         Alma

In [35]:
df_tes = pd.DataFrame(np.random.randint(20,30,size=(7,4)), index=list('abcdefg'),columns=list('KWSD'))
df_tes

    K   W   S   D
a  24  27  29  27
b  20  28  25  26
c  23  23  29  26
d  23  27  28  28
e  26  21  27  20
f  27  26  21  25
g  24  23  28  21

In [36]:
df_tes.loc['c':'f','W':'D']

    W   S   D
c  23  29  26
d  27  28  28
e  21  27  20
f  26  21  25

# <span style='color:#150458 '> Sort Dataframe : </span>

In [37]:
df_emp

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60,13.68,168251,Denver
1,940761,Brenda,47.02,60,9.01,51063,Stonewall
2,428945,Joe,54.15,68,0.98,50155,Michigantown
3,408351,Diane,39.67,51,18.30,180294,Hydetown
4,193819,Benjamin,40.31,58,4.01,117642,Fremont
...,...,...,...,...,...,...,...
95,639892,Jose,22.82,89,1.05,129774,Biloxi
96,704709,Harold,32.61,77,5.93,156194,Carol Stream
97,461593,Nicole,52.66,60,28.53,95673,Detroit
98,392491,Theresa,29.60,57,6.99,51015,Mc Grath
99,495141,Tammy,38.38,55,2.26,93650,Alma

## 1 <span style='color:#E70488 '> | </span> Sort Index

In [38]:
df_emp.sort_index(axis=0)

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60,13.68,168251,Denver
1,940761,Brenda,47.02,60,9.01,51063,Stonewall
2,428945,Joe,54.15,68,0.98,50155,Michigantown
3,408351,Diane,39.67,51,18.30,180294,Hydetown
4,193819,Benjamin,40.31,58,4.01,117642,Fremont
...,...,...,...,...,...,...,...
95,639892,Jose,22.82,89,1.05,129774,Biloxi
96,704709,Harold,32.61,77,5.93,156194,Carol Stream
97,461593,Nicole,52.66,60,28.53,95673,Detroit
98,392491,Theresa,29.60,57,6.99,51015,Mc Grath
99,495141,Tammy,38.38,55,2.26,93650,Alma

In [39]:
df_emp.sort_index(axis=1)

,Age in Company,Age in Yrs,City,Emp ID,First Name,Salary,Weight in Kgs
0,13.68,36.36,Denver,677509,Lois,168251,60
1,9.01,47.02,Stonewall,940761,Brenda,51063,60
2,0.98,54.15,Michigantown,428945,Joe,50155,68
3,18.30,39.67,Hydetown,408351,Diane,180294,51
4,4.01,40.31,Fremont,193819,Benjamin,117642,58
...,...,...,...,...,...,...,...
95,1.05,22.82,Biloxi,639892,Jose,129774,89
96,5.93,32.61,Carol Stream,704709,Harold,156194,77
97,28.53,52.66,Detroit,461593,Nicole,95673,60
98,6.99,29.60,Mc Grath,392491,Theresa,51015,57
99,2.26,38.38,Alma,495141,Tammy,93650,55

## 2 <span style='color:#E70488 '> | </span> Sort Values

In [40]:
df_emp.sort_values('Salary')

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
24,560455,Carolyn,59.42,53,16.08,42005,Saint Cloud
9,162402,Diana,29.73,60,3.44,43010,Eureka Springs
72,951225,Margaret,25.10,56,0.92,43867,Haswell
60,687017,Frances,56.53,42,6.94,46945,Trego
79,325319,Carolyn,41.19,60,2.73,48736,Wheaton
...,...,...,...,...,...,...,...
71,478003,Cynthia,54.16,60,13.41,186200,Kansas City
42,265813,Jack,32.58,50,10.01,186280,Kalvesta
55,253573,Sharon,26.25,43,3.39,190139,Bartley
65,917395,Christopher,57.37,62,19.73,190765,Willow Beach
17,214352,Theresa,24.66,59,2.52,197537,Toeterville

In [41]:
df_emp.sort_values('Salary').iloc[0:5,:]

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
24,560455,Carolyn,59.42,53,16.08,42005,Saint Cloud
9,162402,Diana,29.73,60,3.44,43010,Eureka Springs
72,951225,Margaret,25.10,56,0.92,43867,Haswell
60,687017,Frances,56.53,42,6.94,46945,Trego
79,325319,Carolyn,41.19,60,2.73,48736,Wheaton

In [42]:
df_emp.sort_values('First Name')

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
36,218791,Aaron,48.49,56,20.08,54402,Eckerty
43,247137,Alan,38.65,80,11.15,154810,Knoxville
41,227922,Amanda,35.02,40,10.28,114257,Lake Charles
31,893212,Amy,36.14,52,14.17,112715,Kline
66,183071,Andrea,32.08,52,7.28,54179,Granger
...,...,...,...,...,...,...,...
17,214352,Theresa,24.66,59,2.52,197537,Toeterville
19,622406,Thomas,49.85,73,19.15,73862,Dutchtown
64,917937,Todd,25.93,74,1.22,163560,Randallstown
13,301576,Wayne,21.10,87,0.02,92758,Maida
78,806955,William,50.05,50,17.36,73734,Mary Esther

In [43]:
df_emp.sort_values(['Salary','First Name'])

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
24,560455,Carolyn,59.42,53,16.08,42005,Saint Cloud
9,162402,Diana,29.73,60,3.44,43010,Eureka Springs
72,951225,Margaret,25.10,56,0.92,43867,Haswell
60,687017,Frances,56.53,42,6.94,46945,Trego
79,325319,Carolyn,41.19,60,2.73,48736,Wheaton
...,...,...,...,...,...,...,...
71,478003,Cynthia,54.16,60,13.41,186200,Kansas City
42,265813,Jack,32.58,50,10.01,186280,Kalvesta
55,253573,Sharon,26.25,43,3.39,190139,Bartley
65,917395,Christopher,57.37,62,19.73,190765,Willow Beach
17,214352,Theresa,24.66,59,2.52,197537,Toeterville

In [44]:
df_emp.sort_values('City', ascending=False, inplace=True)

## 3 <span style='color:#E70488 '> | </span> Reset Index

In [45]:
df_emp

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
38,726264,Carl,43.63,90,10.14,162159,Wright
23,388642,Ruby,37.27,59,3.91,160623,Woodbury
65,917395,Christopher,57.37,62,19.73,190765,Willow Beach
85,476433,Lillian,42.79,55,17.65,149878,Wichita
92,969964,Janice,37.57,56,0.93,147641,Whiteman Air Force Base
...,...,...,...,...,...,...,...
6,539712,Nancy,22.14,50,0.87,98189,Atlanta
56,904898,Ann,24.61,44,0.45,182521,Arlee
99,495141,Tammy,38.38,55,2.26,93650,Alma
67,316110,Jeremy,52.51,52,11.33,178847,Alcoa
75,765850,Linda,25.96,40,0.20,113256,Albion

In [46]:
df_emp.reset_index(drop=True,inplace=True)

In [47]:
df_emp

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,726264,Carl,43.63,90,10.14,162159,Wright
1,388642,Ruby,37.27,59,3.91,160623,Woodbury
2,917395,Christopher,57.37,62,19.73,190765,Willow Beach
3,476433,Lillian,42.79,55,17.65,149878,Wichita
4,969964,Janice,37.57,56,0.93,147641,Whiteman Air Force Base
...,...,...,...,...,...,...,...
95,539712,Nancy,22.14,50,0.87,98189,Atlanta
96,904898,Ann,24.61,44,0.45,182521,Arlee
97,495141,Tammy,38.38,55,2.26,93650,Alma
98,316110,Jeremy,52.51,52,11.33,178847,Alcoa
99,765850,Linda,25.96,40,0.20,113256,Albion

## 4 <span style='color:#E70488 '> | </span> Set Index

In [48]:
df_heart

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
299,45,1,3,110,264,0,1,132,0,1.2,1,0,3,0
300,68,1,0,144,193,1,1,141,0,3.4,1,2,3,0
301,57,1,0,130,131,0,1,115,1,1.2,1,1,3,0
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0

In [49]:
df_heart.set_index('age')

,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
age,,,,,,,,,,,,,
63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
45,1,3,110,264,0,1,132,0,1.2,1,0,3,0
68,1,0,144,193,1,1,141,0,3.4,1,2,3,0
57,1,0,130,131,0,1,115,1,1.2,1,1,3,0
57,0,1,130,236,0,0,174,0,0.0,1,1,2,0

In [50]:
df_heart.set_index('age',inplace=True)

In [51]:
df_heart

,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
age,,,,,,,,,,,,,
63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
45,1,3,110,264,0,1,132,0,1.2,1,0,3,0
68,1,0,144,193,1,1,141,0,3.4,1,2,3,0
57,1,0,130,131,0,1,115,1,1.2,1,1,3,0
57,0,1,130,236,0,0,174,0,0.0,1,1,2,0

In [52]:
df_heart.reset_index(drop=False,inplace=True)

In [53]:
df_heart

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
299,45,1,3,110,264,0,1,132,0,1.2,1,0,3,0
300,68,1,0,144,193,1,1,141,0,3.4,1,2,3,0
301,57,1,0,130,131,0,1,115,1,1.2,1,1,3,0
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0

# <span style='color:#150458 '> Handling Missing Values : </span>

In [54]:
df_emp.iloc[4:9,2:6] = np.nan
df_emp.iloc[45:73,[1,6]] = np.nan
df = df_emp.copy()

## 1 <span style='color:#E70488 '> | </span> Detecting Missing Values

###  <span style='color:#E70488 '> [ </span> df.isna() <span style='color:#E70488 '> ] </span>

In [55]:
df.isna()

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False
4,False,False,True,True,True,True,False
...,...,...,...,...,...,...,...
95,False,False,False,False,False,False,False
96,False,False,False,False,False,False,False
97,False,False,False,False,False,False,False
98,False,False,False,False,False,False,False
99,False,False,False,False,False,False,False

In [56]:
df.isna().sum()

Emp ID             0
First Name        28
Age in Yrs         5
Weight in Kgs      5
Age in Company     5
Salary             5
City              28
dtype: int64

###  <span style='color:#E70488 '> [ </span> df.isnull() <span style='color:#E70488 '> ] </span>

In [57]:
df.isnull()

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False
4,False,False,True,True,True,True,False
...,...,...,...,...,...,...,...
95,False,False,False,False,False,False,False
96,False,False,False,False,False,False,False
97,False,False,False,False,False,False,False
98,False,False,False,False,False,False,False
99,False,False,False,False,False,False,False

In [58]:
df.isnull().sum()

Emp ID             0
First Name        28
Age in Yrs         5
Weight in Kgs      5
Age in Company     5
Salary             5
City              28
dtype: int64

In [59]:
df.isnull().mean()

Emp ID            0.00
First Name        0.28
Age in Yrs        0.05
Weight in Kgs     0.05
Age in Company    0.05
Salary            0.05
City              0.28
dtype: float64

In [60]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Emp ID          100 non-null    int64
 1   First Name      72 non-null     object
 2   Age in Yrs      95 non-null     float64
 3   Weight in Kgs   95 non-null     float64
 4   Age in Company  95 non-null     float64
 5   Salary          95 non-null     float64
 6   City            72 non-null     object
dtypes: float64(4), int64(1), object(2)
memory usage: 5.6+ KB

## 2 <span style='color:#E70488 '> | </span> Fill Missing Values

###  <span style='color:#E70488 '> [ </span> df.fillna() <span style='color:#E70488 '> ] </span>

####  <span style='color:#E70488 '> 1.using mean : </span>

In [61]:
df['Age in Yrs'].mean()

38.99442105263158

In [62]:
df['Age in Yrs'].fillna(df['Age in Yrs'].mean(),inplace=True)

In [63]:
df['Age in Yrs'].isnull().sum()

0

####  <span style='color:#E70488 '> 2.using median : </span>

In [64]:
df['Weight in Kgs'].fillna(df['Weight in Kgs'].median(),inplace=True)

In [65]:
df['Weight in Kgs'].isnull().sum()

0

####  <span style='color:#E70488 '> 3.using mode : </span>

In [66]:
df['City'].mode()[0]

'Albion'

In [67]:
df['City'].fillna(df['City'].mode()[0],inplace=True)

In [68]:
df['City'].isnull().sum()

0

####  <span style='color:#E70488 '> 4.using min : </span>

In [69]:
df['Salary'].fillna(df['Salary'].min(),inplace=True)

In [70]:
df['Salary'].isnull().sum()

0

####  <span style='color:#E70488 '> 5.using max : </span>

In [71]:
df['Age in Company'].fillna(df['Age in Company'].max(),inplace=True)

In [72]:
df['Age in Company'].isnull().sum()

0

####  <span style='color:#E70488 '> 6.using static : </span>

In [73]:
df['First Name'].fillna('Max',inplace=True)

In [74]:
df['First Name'].isnull().sum()

0

## 3 <span style='color:#E70488 '> | </span> Drop Missing Values

In [75]:
df_emp.isnull().sum()

Emp ID             0
First Name        28
Age in Yrs         5
Weight in Kgs      5
Age in Company     5
Salary             5
City              28
dtype: int64

###  <span style='color:#E70488 '> [ </span> df.dropna() <span style='color:#E70488 '> ] </span>

####  <span style='color:#E70488 '> 1.drop rows : </span>

In [76]:
df_emp.dropna()

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,726264,Carl,43.63,90.0,10.14,162159.0,Wright
1,388642,Ruby,37.27,59.0,3.91,160623.0,Woodbury
2,917395,Christopher,57.37,62.0,19.73,190765.0,Willow Beach
3,476433,Lillian,42.79,55.0,17.65,149878.0,Wichita
9,214352,Theresa,24.66,59.0,2.52,197537.0,Toeterville
...,...,...,...,...,...,...,...
95,539712,Nancy,22.14,50.0,0.87,98189.0,Atlanta
96,904898,Ann,24.61,44.0,0.45,182521.0,Arlee
97,495141,Tammy,38.38,55.0,2.26,93650.0,Alma
98,316110,Jeremy,52.51,52.0,11.33,178847.0,Alcoa
99,765850,Linda,25.96,40.0,0.20,113256.0,Albion

In [77]:
dd = df_emp.dropna(thresh=3)
dd.isnull().sum()

Emp ID             0
First Name        28
Age in Yrs         5
Weight in Kgs      5
Age in Company     5
Salary             5
City              28
dtype: int64

In [78]:
dd.shape

(100, 7)

####  <span style='color:#E70488 '> 2.drop columns : </span>

In [79]:
df_emp.dropna(axis=1)

    Emp ID
0   726264
1   388642
2   917395
3   476433
4   969964
..     ...
95  539712
96  904898
97  495141
98  316110
99  765850

[100 rows x 1 columns]

In [80]:
df_emp.dropna(axis=1,thresh=95)

    Emp ID  Age in Yrs  Weight in Kgs  Age in Company    Salary
0   726264       43.63           90.0           10.14  162159.0
1   388642       37.27           59.0            3.91  160623.0
2   917395       57.37           62.0           19.73  190765.0
3   476433       42.79           55.0           17.65  149878.0
4   969964         NaN            NaN             NaN       NaN
..     ...         ...            ...             ...       ...
95  539712       22.14           50.0            0.87   98189.0
96  904898       24.61           44.0            0.45  182521.0
97  495141       38.38           55.0            2.26   93650.0
98  316110       52.51           52.0           11.33  178847.0
99  765850       25.96           40.0            0.20  113256.0

[100 rows x 5 columns]

## 4 <span style='color:#E70488 '> | </span> Detecting Non Missing Values

###  <span style='color:#E70488 '> [ </span> df.notna() <span style='color:#E70488 '> ] </span>

In [81]:
df_emp.notna()

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,True,True,True,True,True,True,True
1,True,True,True,True,True,True,True
2,True,True,True,True,True,True,True
3,True,True,True,True,True,True,True
4,True,True,False,False,False,False,True
...,...,...,...,...,...,...,...
95,True,True,True,True,True,True,True
96,True,True,True,True,True,True,True
97,True,True,True,True,True,True,True
98,True,True,True,True,True,True,True
99,True,True,True,True,True,True,True

In [82]:
df_emp.notna().sum()

Emp ID            100
First Name         72
Age in Yrs         95
Weight in Kgs      95
Age in Company     95
Salary             95
City               72
dtype: int64

###  <span style='color:#E70488 '> [ </span> df.notnull() <span style='color:#E70488 '> ] </span>

In [83]:
df_emp.notnull()

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,True,True,True,True,True,True,True
1,True,True,True,True,True,True,True
2,True,True,True,True,True,True,True
3,True,True,True,True,True,True,True
4,True,True,False,False,False,False,True
...,...,...,...,...,...,...,...
95,True,True,True,True,True,True,True
96,True,True,True,True,True,True,True
97,True,True,True,True,True,True,True
98,True,True,True,True,True,True,True
99,True,True,True,True,True,True,True

In [84]:
df_emp.notnull().sum()

Emp ID            100
First Name         72
Age in Yrs         95
Weight in Kgs      95
Age in Company     95
Salary             95
City               72
dtype: int64